Masmiseim36/nxpSDK/devices/MIMXRT798S/iar/startup_MIMXRT798S_cm33_core0.s
        PUBWEAK MEDIA_SECURE_VIOLATION_IRQHandler
        PUBWEAK MEDIA_SECURE_VIOLATION_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
MEDIA_SECURE_VIOLATION_IRQHandler
        LDR     R0, =MEDIA_SECURE_VIOLATION_DriverIRQHandler
        BX      R0

        PUBWEAK RTC0_ALARM_IRQHandler
        PUBWEAK RTC0_ALARM_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
RTC0_ALARM_IRQHandler
        LDR     R0, =RTC0_ALARM_DriverIRQHandler
        BX      R0

        PUBWEAK RTC0_IRQHandler
        PUBWEAK RTC0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
RTC0_IRQHandler
        LDR     R0, =RTC0_DriverIRQHandler
        BX      R0

        PUBWEAK HIFI4_IRQHandler
        PUBWEAK HIFI4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
HIFI4_IRQHandler
        LDR     R0, =HIFI4_DriverIRQHandler
        BX      R0

        PUBWEAK MU0_A_IRQHandler
        PUBWEAK MU0_A_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
MU0_A_IRQHandler
        LDR     R0, =MU0_A_DriverIRQHandler
        BX      R0

        PUBWEAK MU1_A_IRQHandler
        PUBWEAK MU1_A_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
MU1_A_IRQHandler
        LDR     R0, =MU1_A_DriverIRQHandler
        BX      R0

        PUBWEAK MU4_A_IRQHandler
        PUBWEAK MU4_A_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
MU4_A_IRQHandler
        LDR     R0, =MU4_A_DriverIRQHandler
        BX      R0

        PUBWEAK CTIMER2_IRQHandler
        PUBWEAK CTIMER2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CTIMER2_IRQHandler
        LDR     R0, =CTIMER2_DriverIRQHandler
        BX      R0

        PUBWEAK CTIMER4_IRQHandler
        PUBWEAK CTIMER4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CTIMER4_IRQHandler
        LDR     R0, =CTIMER4_DriverIRQHandler
        BX      R0

        PUBWEAK OS_EVENT_IRQHandler
        PUBWEAK OS_EVENT_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
OS_EVENT_IRQHandler
        LDR     R0, =OS_EVENT_DriverIRQHandler
        BX      R0

        PUBWEAK LP_FLEXCOMM6_IRQHandler
        PUBWEAK LP_FLEXCOMM6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LP_FLEXCOMM6_IRQHandler
        LDR     R0, =LP_FLEXCOMM6_DriverIRQHandler
        BX      R0

        PUBWEAK LP_FLEXCOMM7_IRQHandler
        PUBWEAK LP_FLEXCOMM7_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LP_FLEXCOMM7_IRQHandler
        LDR     R0, =LP_FLEXCOMM7_DriverIRQHandler
        BX      R0

        PUBWEAK USDHC0_IRQHandler
        PUBWEAK USDHC0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
USDHC0_IRQHandler
        LDR     R0, =USDHC0_DriverIRQHandler
        BX      R0

        PUBWEAK USDHC1_IRQHandler
        PUBWEAK USDHC1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
USDHC1_IRQHandler
        LDR     R0, =USDHC1_DriverIRQHandler
        BX      R0

        PUBWEAK I3C0_IRQHandler
        PUBWEAK I3C0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
I3C0_IRQHandler
        LDR     R0, =I3C0_DriverIRQHandler
        BX      R0

        PUBWEAK USB0_IRQHandler
        PUBWEAK USB0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
USB0_IRQHandler
        LDR     R0, =USB0_DriverIRQHandler
        BX      R0

        PUBWEAK USB1_IRQHandler
        PUBWEAK USB1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
USB1_IRQHandler
        LDR     R0, =USB1_DriverIRQHandler
        BX      R0

        PUBWEAK WDT0_IRQHandler
        PUBWEAK WDT0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
WDT0_IRQHandler
        LDR     R0, =WDT0_DriverIRQHandler
        BX      R0

        PUBWEAK WDT1_IRQHandler
        PUBWEAK WDT1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
WDT1_IRQHandler
        LDR     R0, =WDT1_DriverIRQHandler
        BX      R0

        PUBWEAK USBPHY0_IRQHandler
        PUBWEAK USBPHY0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
USBPHY0_IRQHandler
        LDR     R0, =USBPHY0_DriverIRQHandler
        BX      R0

        PUBWEAK PUF_IRQHandler
        PUBWEAK PUF_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PUF_IRQHandler
        LDR     R0, =PUF_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved62_IRQHandler
        PUBWEAK Reserved62_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved62_IRQHandler
        LDR     R0, =Reserved62_DriverIRQHandler
        BX      R0

        PUBWEAK LP_FLEXCOMM8_IRQHandler
        PUBWEAK LP_FLEXCOMM8_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LP_FLEXCOMM8_IRQHandler
        LDR     R0, =LP_FLEXCOMM8_DriverIRQHandler
        BX      R0

        PUBWEAK LP_FLEXCOMM9_IRQHandler
        PUBWEAK LP_FLEXCOMM9_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LP_FLEXCOMM9_IRQHandler
        LDR     R0, =LP_FLEXCOMM9_DriverIRQHandler
        BX      R0

        PUBWEAK LP_FLEXCOMM10_IRQHandler
        PUBWEAK LP_FLEXCOMM10_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LP_FLEXCOMM10_IRQHandler
        LDR     R0, =LP_FLEXCOMM10_DriverIRQHandler
        BX      R0

        PUBWEAK LP_FLEXCOMM11_IRQHandler
        PUBWEAK LP_FLEXCOMM11_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LP_FLEXCOMM11_IRQHandler
        LDR     R0, =LP_FLEXCOMM11_DriverIRQHandler
        BX      R0

        PUBWEAK LP_FLEXCOMM12_IRQHandler
        PUBWEAK LP_FLEXCOMM12_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LP_FLEXCOMM12_IRQHandler
        LDR     R0, =LP_FLEXCOMM12_DriverIRQHandler
        BX      R0

        PUBWEAK LP_FLEXCOMM13_IRQHandler
        PUBWEAK LP_FLEXCOMM13_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LP_FLEXCOMM13_IRQHandler
        LDR     R0, =LP_FLEXCOMM13_DriverIRQHandler
        BX      R0

        PUBWEAK LPSPI16_IRQHandler
        PUBWEAK LPSPI16_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPSPI16_IRQHandler
        LDR     R0, =LPSPI16_DriverIRQHandler
        BX      R0

        PUBWEAK I3C1_IRQHandler
        PUBWEAK I3C1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
I3C1_IRQHandler
        LDR     R0, =I3C1_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXIO_IRQHandler
        PUBWEAK FLEXIO_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXIO_IRQHandler
        LDR     R0, =FLEXIO_DriverIRQHandler
        BX      R0

