Masmiseim36/nxpSDK/devices/MIMXRT798S/iar/startup_MIMXRT798S_cm33_core0.s
        PUBWEAK MMU0_IRQHandler
        PUBWEAK MMU0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
MMU0_IRQHandler
        LDR     R0, =MMU0_DriverIRQHandler
        BX      R0

        PUBWEAK MMU1_IRQHandler
        PUBWEAK MMU1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
MMU1_IRQHandler
        LDR     R0, =MMU1_DriverIRQHandler
        BX      R0

        PUBWEAK MMU2_IRQHandler
        PUBWEAK MMU2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
MMU2_IRQHandler
        LDR     R0, =MMU2_DriverIRQHandler
        BX      R0

        PUBWEAK Freqme_IRQHandler
        PUBWEAK Freqme_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Freqme_IRQHandler
        LDR     R0, =Freqme_DriverIRQHandler
        BX      R0

        PUBWEAK GDET0_IRQHandler
        PUBWEAK GDET0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GDET0_IRQHandler
        LDR     R0, =GDET0_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved142_IRQHandler
        PUBWEAK Reserved142_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved142_IRQHandler
        LDR     R0, =Reserved142_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved143_IRQHandler
        PUBWEAK Reserved143_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved143_IRQHandler
        LDR     R0, =Reserved143_DriverIRQHandler
        BX      R0

        PUBWEAK GDET3_IRQHandler
        PUBWEAK GDET3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GDET3_IRQHandler
        LDR     R0, =GDET3_DriverIRQHandler
        BX      R0

        PUBWEAK CDOG0_IRQHandler
        PUBWEAK CDOG0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CDOG0_IRQHandler
        LDR     R0, =CDOG0_DriverIRQHandler
        BX      R0

        PUBWEAK CDOG1_IRQHandler
        PUBWEAK CDOG1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CDOG1_IRQHandler
        LDR     R0, =CDOG1_DriverIRQHandler
        BX      R0

        PUBWEAK CDOG2_IRQHandler
        PUBWEAK CDOG2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CDOG2_IRQHandler
        LDR     R0, =CDOG2_DriverIRQHandler
        BX      R0

        PUBWEAK ITRC0_IRQHandler
        PUBWEAK ITRC0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ITRC0_IRQHandler
        LDR     R0, =ITRC0_DriverIRQHandler
        BX      R0

        PUBWEAK ELS_IRQHandler
        PUBWEAK ELS_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ELS_IRQHandler
        LDR     R0, =ELS_DriverIRQHandler
        BX      R0

        PUBWEAK PKC_IRQHandler
        PUBWEAK PKC_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PKC_IRQHandler
        LDR     R0, =PKC_DriverIRQHandler
        BX      R0

        PUBWEAK OSCCA_IRQHandler
        PUBWEAK OSCCA_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
OSCCA_IRQHandler
        LDR     R0, =OSCCA_DriverIRQHandler
        BX      R0

        PUBWEAK SLEEPCON0_IRQHandler
        PUBWEAK SLEEPCON0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SLEEPCON0_IRQHandler
        LDR     R0, =SLEEPCON0_DriverIRQHandler
        BX      R0

        PUBWEAK CPU0_IRQHandler
        PUBWEAK CPU0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CPU0_IRQHandler
        LDR     R0, =CPU0_DriverIRQHandler
        BX      R0

        PUBWEAK PMC_IRQHandler
        PUBWEAK PMC_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PMC_IRQHandler
        LDR     R0, =PMC_DriverIRQHandler
        BX      R0

        PUBWEAK JPEGDEC_IRQHandler
        PUBWEAK JPEGDEC_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
JPEGDEC_IRQHandler
        LDR     R0, =JPEGDEC_DriverIRQHandler
        BX      R0

        PUBWEAK PNGDEC_IRQHandler
        PUBWEAK PNGDEC_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PNGDEC_IRQHandler
        LDR     R0, =PNGDEC_DriverIRQHandler
        BX      R0

        PUBWEAK NPU_IRQHandler
        PUBWEAK NPU_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
NPU_IRQHandler
        LDR     R0, =NPU_DriverIRQHandler
        BX      R0

        PUBWEAK TRNG_IRQHandler
        PUBWEAK TRNG_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
TRNG_IRQHandler
        LDR     R0, =TRNG_DriverIRQHandler
        BX      R0

        PUBWEAK TEMPDET0_IRQHandler
        PUBWEAK TEMPDET0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
TEMPDET0_IRQHandler
        LDR     R0, =TEMPDET0_DriverIRQHandler
        BX      R0

        PUBWEAK TEMPDET1_IRQHandler
        PUBWEAK TEMPDET1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
TEMPDET1_IRQHandler
        LDR     R0, =TEMPDET1_DriverIRQHandler
        BX      R0

        PUBWEAK EZHV_IRQHandler
        PUBWEAK EZHV_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EZHV_IRQHandler
        LDR     R0, =EZHV_DriverIRQHandler
        BX      R0

        PUBWEAK GLIKEY0_IRQHandler
        PUBWEAK GLIKEY0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GLIKEY0_IRQHandler
        LDR     R0, =GLIKEY0_DriverIRQHandler
        BX      R0

        PUBWEAK GLIKEY2_IRQHandler
        PUBWEAK GLIKEY2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GLIKEY2_IRQHandler
        LDR     R0, =GLIKEY2_DriverIRQHandler
        BX      R0

        PUBWEAK GLIKEY3_IRQHandler
        PUBWEAK GLIKEY3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GLIKEY3_IRQHandler
        LDR     R0, =GLIKEY3_DriverIRQHandler
        BX      R0

        PUBWEAK GLIKEY5_IRQHandler
        PUBWEAK GLIKEY5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GLIKEY5_IRQHandler
        LDR     R0, =GLIKEY5_DriverIRQHandler
        BX      R0

        PUBWEAK PVTS0_CPU0_IRQHandler
        PUBWEAK PVTS0_CPU0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PVTS0_CPU0_IRQHandler
        LDR     R0, =PVTS0_CPU0_DriverIRQHandler
        BX      R0

